# Дана сторона квадрата a. Знайти його площу S=a2
a=int (input("Введіть a ="))
print('Площа квадрата S','=',a,'^2','=',a**2)

